{
  "metadata": {
    "total_parameters": 4870267904,
    "total_size": 19481071616
  },
  "weight_map": {
    "lm_head.weight": "model-00004-of-00004.safetensors",
    "model.embed_tokens.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.block_sparse_moe.gate.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.block_sparse_moe.gate.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.1.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.5.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.5.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.5.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.6.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.6.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.6.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.7.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.7.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.7.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.8.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.8.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.8.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.9.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.9.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.experts.9.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.block_sparse_moe.gate.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.input_layernorm.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.self_attn.k_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.self_attn.o_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.self_attn.q_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.10.self_attn.v_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.0.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.1.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.1.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.1.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.10.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.10.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.10.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.11.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.11.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.11.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.12.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.12.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.12.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.13.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.13.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.13.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.14.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.14.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.14.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.15.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.15.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.15.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.16.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.16.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.16.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.17.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.17.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.17.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.18.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.18.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.18.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.19.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.19.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.19.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.2.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.2.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.2.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.20.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.20.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.20.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.21.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.21.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.21.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.22.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.22.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.22.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.23.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.23.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.23.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.24.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.24.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.24.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.25.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.25.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.25.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.26.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.26.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.26.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.27.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.27.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.27.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.28.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.28.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.28.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.29.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.29.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.29.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.3.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.3.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.3.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.30.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.30.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.30.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.31.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.31.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.31.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.4.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.4.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.4.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.5.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.5.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.5.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.6.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.6.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.6.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.7.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.7.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.7.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.8.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.8.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.8.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.9.w1.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.9.w2.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.experts.9.w3.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.block_sparse_moe.gate.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.input_layernorm.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.self_attn.k_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.self_attn.o_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.self_attn.q_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.11.self_attn.v_proj.weight": "model-00004-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.1.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.1.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.1.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.10.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.10.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.10.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.11.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.11.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.11.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.12.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.12.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.12.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.13.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.13.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.13.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.14.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.14.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.14.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.15.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.15.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.15.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.16.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.16.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.16.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.17.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.17.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.17.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.18.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.18.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.18.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.19.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.19.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.19.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.2.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.2.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.2.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.20.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.20.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.20.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.21.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.21.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.21.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.22.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.22.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.22.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.23.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.23.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.23.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.24.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.24.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.24.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.25.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.25.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.25.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.26.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.26.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.26.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.27.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.27.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.27.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.28.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.28.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.28.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.29.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.29.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.29.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.3.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.3.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.3.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.30.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.30.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.30.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.31.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.31.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.31.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.4.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.4.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.4.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.5.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.5.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.5.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.6.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.6.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.6.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.7.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.7.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.7.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.8.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.8.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.8.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.9.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.9.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.experts.9.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.block_sparse_moe.gate.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.2.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.1.w1.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.1.w2.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.1.w3.weight": "model-00001-of-00004.safetensors",
    "model.layers.3.block_sparse_moe.experts.10.w1.weight": "model-00002-of-00004.safetensors",
